const buildingRooms = {
  "buildings": [
    "生田会館", "8号館", "7号館", "図書館別館", "6号館", "購買会", "セブンイレブン",
    "国際交流会館", "第3学生自治会館", "食堂館", "4号館", "第2学生自治会館", "3号館",
    "2号館", "総合体育館", "10号館", "第1学生自治会館", "グリーントップ", "第1体育館",
    "5号館", "1号館", "駐車場", "喫煙所", "9号館"
  ],

  "1号館": [
    "CALL教室A", "CALL教室B", "CALL教室D", "CALL実習室", "CALL教室C",
    "ライブラリー", "CALL事務室", "録音室", "ストックルーム", "機械室",
    "考古学実習室", "考古学資料室", "地理実習室", "地理学実験室", "電気室",
    "水槽ポンプ室", "自然科学教育研究室", "倉庫", "エレベーター",
    "端末室1", "端末室2", "118", "117", "端末室4",
    "端末室3", "プリンタ室1", "端末室6", "端末室5", "印刷室",
    "プリンタ室2", "114", "125", "124", "マルチメディア実習室",
    "121", "122", "123", "相談室", "1号館実習室受付",
    "ネットワーク実習室", "1205", "1206", "1207", "第6会議室",
    "1201", "1202", "研究室受付", "1203", "1204",
    "談話室", "1310", "1309", "1308", "132",
    "1302", "1303", "1304", "1305", "1306",
    "湯沸室", "ロッカー", "入室管理サーバ室", "情報科学研究所", "ワーキングスペース",
    "1307", "131", "133", "プレゼンテーションスペース", "1301",
    "機械室", "1413", "1411", "1410", "1409",
    "1408", "1412", "1407", "1406", "1405",
    "1404", "1403", "1402", "1401", "湯沸室",
    "ディスカッションスペース2", "ディスカッションスペース1", "ユーザテストルーム", "プリンター"
  ],

  "2号館": [
    "2号館", "準備室", "アカデミーモール1", "実習室受付", "博物館実習室準備室", "博物館実習室",
    "展示実習室", "調整室", "収録スタジオ", "大学院事務室", "アカデミーモール2",
    "史学古文書調査実習室", "222", "223", "224", "227",
    "226", "225", "221", "博士後期課程院生自習室", "地図資料室",
    "地理学空間情報処理室", "アカデミーモール3", "アカデミーモール4", "プリンター", "エレベーター","休憩所"
  ],

  "3号館": [
    "3号館", "社会知性開発研究センター5", "社会知性開発研究センター4", "社会知性開発研究センター3", "研究室受付", "社会知性開発研究センター1",
    "社会知性開発研究センター2", "社会知性開発研究センター事務室", "印刷室", "3201", "3202",
    "3203", "3204", "3205", "3206", "3212",
    "3211", "3210", "3209", "3208", "3207",
    "学友会室", "335", "334", "333", "331",
    "3303研究室", "3302研究室", "332", "3301研究室", "336",
    "337", "338", "339", "3304研究室", "3305研究室",
    "3306研究室", "3307研究室", "印刷室", "3401研究室", "3402研究室",
    "3403研究室", "3404研究室", "3405研究室", "3406研究室", "3407研究室",
    "3408研究室", "3409研究室", "3410研究室", "3411研究室", "3420研究室",
    "3419研究室", "3418研究室", "3417研究室", "3416研究室", "3415研究室",
    "3414研究室", "3412研究室", "3413研究室", "エレベーター", "3520研究室",
    "3519研究室", "3518研究室", "3517研究室", "3516研究室", "3515研究室",
    "3514研究室", "3513研究室", "3512研究室", "3502研究室", "3503研究室",
    "3504研究室", "3505研究室", "3506研究室", "3507研究室", "3508研究室",
    "3509研究室", "3510研究室", "3511研究室", "3501研究室", "3601研究室",
    "3602研究室", "3603研究室", "3604研究室", "3605研究室", "3606研究室",
    "3607研究室", "3608研究室", "3609研究室", "3610研究室", "3611研究室",
    "3620研究室", "3619研究室", "3618研究室", "3617研究室", "3616研究室",
    "3615研究", "3614研究室", "3613研究室", "3612研究室", "蒼翼の間", "パントリー", "ラウンジ","休憩所"
  ],

  "4号館": [
    "4号館", "経理課", "教務課第1事務室", "410", "学生生活課", "キャンパスハラスメント対策室",
    "障がい学生支援室", "保健室", "倉庫", "420", "FD事務室",
    "広報課", "教務課第2事務室", "ATM", "キャリア形成支援課第2事務室", "421",
    "422", "423", "424", "429", "428",
    "427", "426", "425", "応接室", "キャリア形成支援課第1事務室",
    "キャリア形成支援課", "給湯室", "資料室", "相談室", "社会学パソコン室",
    "社会調査実習室3", "社会調査実習室2", "総合情報資料室(映像分析室)", "共同編集室", "社会調査実習室1",
    "カンファレンスルーム", "社会学研究教員室", "心理学研究教員室", "準備室K(社会心理学)", "I1", "準備室K", "準備室I", "準備室J", "準備室H", "準備室F", "準備室G",
    "I2", "J1", "J2", "H2", "H1",
    "準備室I(認知発達心理学)", "準備室J(発達臨床心理学)", "準備室H(障害児心理学)", "準備室F(臨床心理学)", "準備室G(心理査定学)",
    "K1", "K2", "資料閲覧室", "実習助手室", "準備室N(知覚心理学)",
    "N2", "N1", "L1", "L2", "準備室M(心理統計学)",
    "G2", "G1", "F2", "F1", "M2",
    "M1", "準備室L(認知心理学)", "4403", "4402", "プレイルーム1",
    "ゼミ44A", "4401", "プレイルーム2", "準備室C", "集団面接室",
    "行動観察室", "C1実習室", "準備室B", "B2実験室", "B1実験室",
    "A2実験室", "準備室A", "A1実験室", "心理学パソコン室2", "ゼミ44B",
    "4405", "準備室D", "4404", "UNIX室コンピューター室", "心理学科サーバー室",
    "準備室E", "資料保管室", "E1実習室", "D1実習室", "脳波室",
    "脳波実験準備室", "心理学パソコン室1", "情報処理準備室", "エレベーター",
    "研究室9", "研究室7", "研究室6", "研究室5", "研究室4", "研究室3",
    "研究室2", "研究室1", "研究室21", "研究室22", "研究室23",
    "研究室24", "研究室10", "研究室11", "研究室12", "演習室7",
    "研究室13", "研究室14", "研究室15", "研究室16", "研究室17",
    "研究室18", "研究室19", "研究室20", "演習室11", "社会学調査実習室6",
    "演習室9", "演習室8", "社会学調査実習室5", "社会学調査実習室4", "演習室2",
    "演習室1", "地理学調査実習室", "受付", "研究室8"
  ],

  "5号館": [
    "5号館", "511", "自然科学実験室1", "自然科学実験室2", "生命科学実験室1", "生命科学実験室3",
    "生命科学実験室2", "生理実験室", "体力測定室", "社会体育研究室", "体育研究室",
    "体育実験実習室", "電気室", "シャワー室", "更衣室", "ボイラー室", "倉庫", "522",
    "528", "527", "526", "525", "521", "524", "523", "研究室1", "研究室2",
    "研究室3", "研究室4", "研究室5", "研究室6", "研究室7", "研究室8", "研究室9",
    "研究室10", "研究室11", "研究室12", "コピー室", "研究室15", "研究室14",
    "研究室13", "ゼミ56", "ゼミ55", "ゼミ54", "ゼミ53", "ゼミ52", "ゼミ51"
  ],

  "7号館": [
    "7号館", "702", "701", "713", "712", "711", "714", "723", "722", "721", "725",
    "724", "ゼミ75", "ゼミ74", "ゼミ73", "ゼミ72", "ゼミ71", "ゼミ70",
    "ゼミ79", "ゼミ78", "ゼミ77", "ゼミ76",
  ],

  "8号館": [
    "8号館", "811", "812", "813", "814", "821", "822", "823", "824", "8301", "8302",
    "8303", "8304", "8305", "8306", "8307", "8308", "8309", "8310", "8311",
    "8312", "8313", "8314", "8315", "8316", "8317", "8318", "M831", "8319",
    "8320", "8321", "8322", "8323", "8324", "8329", "8328", "8327", "8326",
    "8325", "M832", "コピー室", "8430", "8431", "8432", "8433", "8434",
    "8401", "8402", "8403", "8404", "8405", "8406", "8407", "8408", "8409",
    "8410", "8418", "8417", "8416", "8415", "8414", "8413", "8412", "会議室841",
    "8411", "バルコニー", "8438", "8437", "8436", "8435", "8419", "8420",
    "8421", "8422", "8424", "8423", "8428", "8429", "8427", "8426", "8425",
    "84共同研究室", "コピー室", "湯沸室", "エレベーター", "受付", "購買会",
  ],

  "9号館": [
    "入学センターインフォメーション", "庶務課", "守衛室", "会議室92F", "会議室92C", "会議室92B", "会議室92A",
    "会議室92D", "会議室92E", "マイクロ資料庫", "グループ閲覧室2", "館長室", "グループ閲覧室1", "マイクロ資料庫",
    "AVルーム", "作業室", "端末室A", "アクティブラーニング・プラザ", "資料室", "端末室B", "端末室C",
    "端末室D", "端末室F", "プリンター室", "端末室E", "センター長室センター員室", "ネットワーク室",
    "システム開発室", "共同実習室B", "共同実習室A", "CVCF室", "マシン室", "カウンター", "第二開架閲覧室",
    "調整室", "9513", "9514", "9515", "9516", "9517", "9518", "9519", "9520", "9521", "9522", "9523",
    "9524", "9525", "ゼミ95D", "ゼミ95E", "ゼミ95F", "ゼミ95G", "ゼミ95H", "ゼミ95I", "ゼミ95J", "ゼミ95A",
    "ゼミ95B", "ゼミ95C", "9501", "9502", "9503", "9504", "9505", "9506", "9507", "9508", "9509", "9510",
    "9511", "9512", "管理課", "相談室", "国際交流センター", "多目的会議室", "応接室", "センター長室", "レストラン",
    "テラス", "屋上", "9601", "9602", "9603", "9604", "9605", "9606", "9607", "9608", "9610", "9609",
    "9611", "会議室M969", "9612", "9613", "9614", "9615", "9616", "9617", "9618", "9619", "9620",
    "9621", "9622", "9623", "9624", "印刷室", "961", "962", "963", "964", "965",
    "966", "967", "監事室", "役員会議室", "学務課", "企画課", "学長室", "副学長室",
    "学部長室", "理事長室", "理事室", "968", "教室971", "教室972", "教室973",
    "教室974", "教室975", "教室976", "教室977", "教室978", "教室979", "9701",
    "9704", "9703", "9706", "9705", "97共同研究室", "9702", "9709", "9711", 
    "9712", "9710", "9708", "9707", "9713", "9718", "9716", "9717", "9714", 
    "9715", "9719", "9721", "9720", "9722", "9726", "9724", "9725", "9723", 
    "9727", "コピー室", "テラス", "ゼミ98A", "ゼミ98B", "ゼミ98C", "ゼミ98F", 
    "書道室", "教員室","休憩所"
  ],

  "10号館": [
    "ゼミ101H", "ゼミ101G", "ゼミ101F", "ゼミ101E", "ゼミ101D",
    "ゼミ101C", "ゼミ101B", "ゼミ101A", "10103", "10102",
    "10101", "情報コアゾーン", "10215", "10208", "10207",
    "10206", "10205", "10204", "10210", "10211",
    "10212", "10213", "10214", "10203", "10202",
    "10201", "10209", "10310", "10311", "10312",
    "10313", "10314", "10309", "10308", "10307",
    "10306", "10305", "10315", "10304", "10303",
    "10302", "10301", "バリアフリートイレ", "食堂",
    "ソフトクリーム屋", "モスバーガー", "ゼミ105J", "ゼミ105I", "ゼミ105H",
    "ゼミ105G", "ゼミ105F", "ゼミ105E", "ゼミ105D", "ゼミ105C",
    "ゼミ105B", "ゼミ105A", "ゼミ105K", "ゼミ105L", "ゼミ105M",
    "ゼミ105N", "ゼミ105O", "ゼミ105P", "ゼミ105Q", "ゼミ105R",
    "ゼミ105S", "ゼミ105T", "ゼミ105U", "ゼミ105V", "ゼミ105W",
    "ゼミ105X", "研究室10647", "研究室10648", "研究室10646", "研究室10645",
    "研究室10644", "研究室10643", "研究室10642", "研究室10641", "研究室10607",
    "研究室10606", "研究室10605", "研究室10604", "研究室10603", "研究室10601",
    "研究室10602", "研究室10617", "研究室10616", "研究室10618", "研究室10619",
    "研究室10620", "研究室10621", "研究室10622", "研究室10623", "研究室10624",
    "研究室10625", "研究室10626", "研究室10627", "研究室10628", "研究室10629",
    "研究室10631", "研究室10630", "研究室10638", "研究室10639", "研究室10637",
    "研究室10636", "研究室10635", "研究室10634", "研究室10633", "研究室10632",
    "研究室10615", "研究室10614", "研究室10613", "研究室10612", "研究室10611",
    "研究室10610", "研究室10608", "研究室10609", "研究室10610", "研究室受付", "プリンター", "エレベーター","休憩所"
  ],

  "グリーントップ": [
    "グリーントップ", "学生相談室・事務室・カウンセラー控室", "相談室1", "相談室2", "相談室3", "待合スペース",
    "相談室4", "湯沸室", "バリアフリートイレ", "レストラン", "エレベーター"
  ],

  "総合体育館": [
    "総合体育館", "アリーナ", "応接室", "体育事務課", "アリーナ監視室", "男子シャワー室",
    "男子ロッカー室", "女子ロッカー室", "女子シャワー室", "職員ロッカー室", "シャワー室", "用具室"
  ],

  "食堂館": [
    "食堂"
  ],
};

export { buildingRooms };
